{
  "_id": {
    "$oid": "68ecf00b6c43da02c16892f7"
  },
  "title": "Layer Recurrent Neural Network-Based Diagnosis of Parkinson's Disease Using Voice Features",
  "authors": [
    {
      "name": "Zehra Karapinar Senturk",
      "affiliations": [
        {
          "institution": "Duzce University",
          "country": "Turkey"
        }
      ]
    }
  ],
  "publication_type": "Journal",
  "journal": "Biomedical Engineering",
  "year": 2022,
  "doi": "10.1515/bmt-2022-0022",
  "abstract": "Parkinson's disease (PD), a slow-progressing neurological disease, affects a large percentage of the world's elderly population, and this population is expected to grow over the next decade. As a result, early detection is crucial for community health and the future of the globe in order to take proper safeguards and have a less arduous treatment procedure. Recent research has begun to focus on the motor system deficits caused by PD. Because practically most of the PD patients suffer from voice abnormalities, researchers working on automated diagnostic systems investigate vocal impairments. In this paper, we undertake extensive experiments with features extracted from voice signals. We propose a layer Recurrent Neural Network (RNN) based diagnosis for PD. To prove the efficiency of the model, different network models are compared. To the best of our knowledge, several neural network topologies, namely RNN, Cascade Forward Neural Networks (CFNN), and Feed Forward Neural Networks (FFNN), are used and compared for voice-based PD detection for the first time. In addition, the impacts of data normalization and feature selection (FS) are thoroughly examined. The findings reveal that normalization increases classifier performance and Laplacian-based FS outperforms. The proposed RNN model with 300 voice features achieves 99.74% accuracy.",
  "ml_approaches": [
    {
      "algorithm": "Recurrent Neural Network",
      "feature_selection": {
        "methods": [
          "Laplacian Score"
        ]
      },
      "validation": "Leave-One-Subject-Out cross-validation",
      "results": {
        "accuracy": 0.9974,
        "f1_score": 0.9982,
        "mcc": 0.993
      }
    }
  ],
  "source_dataset": [
    {
      "name": "Parkinson's Disease Classification",
      "size": 252,
      "pd_patients": 188,
      "controls": 64,
      "url": "https://archive.ics.uci.edu/dataset/470/parkinson+s+disease+classification",
      "doi": "10.24432/C5MS4X"
    }
  ],
  "target_dataset": [
    {
      "name": "Parkinson's Disease Classification",
      "size": 252,
      "pd_patients": 188,
      "controls": 64,
      "url": "https://archive.ics.uci.edu/dataset/470/parkinson+s+disease+classification",
      "doi": "10.24432/C5MS4X"
    }
  ],
  "study_id": "10.1515/bmt-2022-0022_1"
}